tutorials/compressible/sonicFoam/ras/nacaAirfoil/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.0                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     sonicFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         0.01;

deltaT          4e-08;

writeControl    runTime;

writeInterval   2e-04;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression compressed;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

functions
{
    forces
    {
        type        forceCoeffs;
        functionObjectLibs ( "libforces.so" );
        outputControl timeStep;
        outputInterval 1;
        patches
        (
            WALL10
        );
        pName       p;
        UName       U;
        log         true;
        rhoInf      1;
        CofR        ( 0 0 0 );
        liftDir     ( -0.239733 0.970839 0 );
        dragDir     ( 0.970839 0.239733 0 );
        pitchAxis   ( 0 0 1 );
        magUInf     618.022;
        lRef        1;
        Aref        1;
    }
}

// ************************************************************************* //
